app/controllers/articles_controller.rb

    def index
        @article_details = ArticleDetail.paginate(page: params[:page], per_page: 555)
---
SELECT COUNT(*) FROM `article_details`