app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])

    unless session["viewed_post_#{@post.id}"]
      @post.increment!(:views_count)
---
UPDATE `posts` SET `posts`.`updated_at` = '2023-11-22 02:33:42.530040' WHERE `posts`.`id` = 58