app/controllers/posts_controller.rb

    def index
        @posts = Post.paginate(page: params[:page], per_page: 10)
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 10 OFFSET 0

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO `posts` (`title`, `description`, `thumbnail`, `created_at`, `updated_at`) VALUES ('fasfasfasfa131231', 'fasfasfasfa131231', NULL, '2023-11-23 03:33:25.451302', '2023-11-23 03:33:25.451302')

    def update
        if @post.thumbnail.attached? && params[:thumbnail]
            @post.thumbnail.purge
        end

        if @post.update(post_params)
---
UPDATE `posts` SET `posts`.`title` = 'Arms ', `posts`.`description` = '*Velit*', `posts`.`updated_at` = '2023-11-23 02:42:31.409635' WHERE `posts`.`id` = 160